cisco.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-30 Thu 18:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cisco</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">cisco</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. IOS</a>
<ul>
<li><a href="#org0000001">1.1. domain-lookup</a></li>
<li><a href="#org0000002">1.2. ipv6</a></li>
<li><a href="#org0000003">1.3. RIP routing</a>
<ul>
<li><a href="#org0000004">1.3.1. ipv6</a></li>
<li><a href="#org0000005">1.3.2. ipv4</a></li>
</ul>
</li>
<li><a href="#org0000006">1.4. access list (firewall)</a>
<ul>
<li><a href="#org0000007">1.4.1. ipv6</a></li>
<li><a href="#org0000008">1.4.2. ipv4</a></li>
</ul>
</li>
<li><a href="#org0000009">1.5. security</a>
<ul>
<li><a href="#org000000a">1.5.1. ssh</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org000000b">2. packettracer</a>
<ul>
<li><a href="#org000000c">2.1. acquiring</a></li>
<li><a href="#org000000d">2.2. fonts</a></li>
<li><a href="#org000000e">2.3. port labels</a></li>
<li><a href="#org000000f">2.4. batch editing</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> IOS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> domain-lookup</h3>
<div class="outline-text-3" id="text-1-1">
<p>
by default when not in config mode, unknown commands will be
interpreted as domains to look up. this causes it to freeze for a
while when typo'ing a command.
</p>

<p>
to cancel it, press <code>C-S-6</code>, and to disable it entirely, use
</p>
<pre class="example" id="org0000010">
no ip domain-lookup
</pre>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> ipv6</h3>
<div class="outline-text-3" id="text-1-2">
<p>
its as if they realized how ridiculous some of the syntax was, decided
to fix it when implementing ipv6, and then were too afraid of breaking
backwards compatibility to fix the ipv4 syntax as well. now there are
two, completely different, methods of doing everything, and you need
to remember both if you want dual stack ipv6/ipv4.
</p>

<p>
with that said, there will be separate ipv6 and ipv4 parts for each
relevant section.
</p>

<p>
ipv6 is disabled by default, to enable it:
</p>
<pre class="example" id="org0000010">
ipv6 unicast-routing
</pre>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.3.</span> RIP routing</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org0000004" class="outline-4">
<h4 id="org0000004"><span class="section-number-4">1.3.1.</span> ipv6</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example" id="org0000010">
ipv6 router rip myrip
exit
int g0/0
ipv6 rip myrip enable
end
</pre>
</div>
</div>

<div id="outline-container-org0000005" class="outline-4">
<h4 id="org0000005"><span class="section-number-4">1.3.2.</span> ipv4</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example" id="org0000010">
router rip
ver 2
network 192.168.100.0
end
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">1.4.</span> access list (firewall)</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org0000007" class="outline-4">
<h4 id="org0000007"><span class="section-number-4">1.4.1.</span> ipv6</h4>
<div class="outline-text-4" id="text-1-4-1">
<pre class="example" id="org0000010">
ipv6 access-list mylist
deny tcp fd::/8 host fd40::100:2 eq 22
permit tcp any host fd40::100:3 eq 443
deny tcp any host fd40::100:3
permit any any ! allow everything else, negating the implicit-deny rule
exit
int g0/0
ipv6 traffic-filter mylist in
end
</pre>
</div>
</div>

<div id="outline-container-org0000008" class="outline-4">
<h4 id="org0000008"><span class="section-number-4">1.4.2.</span> ipv4</h4>
<div class="outline-text-4" id="text-1-4-2">
<pre class="example" id="org0000010">
access-list 101 deny tcp 192.168.0.0 0.0.255.255 host 192.168.100.2
access-list 101 permit tcp any host 192.168.100.3 eq 443
access-list 101 deny tcp any host 192.168.100.3
access-list 101 permit tcp any any
access-list 101 permit udp any any
access-list 101 permit icmp any any
exit
int g0/0
ip access-group 101 in
end
</pre>

<p>
lists can also be named making it closer to ipv6's syntax:
</p>
<pre class="example" id="org0000010">
ip access-list extended mylist
deny...
permit...
exit
int g0/0
ip access-group mylist in
end
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000009" class="outline-3">
<h3 id="org0000009"><span class="section-number-3">1.5.</span> security</h3>
<div class="outline-text-3" id="text-1-5">
<p>
given that the strongest cryptography it supports can be described as
obsolete at best, it is probably a good idea to disable all remote
management and just use the serial console.
</p>
</div>

<div id="outline-container-org000000a" class="outline-4">
<h4 id="org000000a"><span class="section-number-4">1.5.1.</span> ssh</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
ssh requires a hostname and a domain to use for the host key:
</p>
<pre class="example" id="org0000010">
hostname beans
ip domain-name example.org
</pre>

<p>
generate an rsa host key, as it does not support elliptic curve
cryptography:
</p>
<pre class="example" id="org0000010">
crypto key generate rsa
</pre>
<p>
use the maximum number of bits allowed (2048), anything less is
insecure.
</p>

<p>
ssh should automatically start now.
</p>

<p>
create a user:
</p>
<pre class="example" id="org0000010">
username vulpine password aPbqCNpRT9W5ec6CphW6rJy4Dw
</pre>

<p>
time to set the vtys to use it:
</p>
<pre class="example" id="org0000010">
line vty 0 15
trans in ssh
login local
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org000000b" class="outline-2">
<h2 id="org000000b"><span class="section-number-2">2.</span> packettracer</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org000000c" class="outline-3">
<h3 id="org000000c"><span class="section-number-3">2.1.</span> acquiring</h3>
<div class="outline-text-3" id="text-2-1">
<p>
pt officially "only supports ubuntu" when it comes to linux,
distributing it as a <code>.deb</code> file. however, after extracting the files
inside, it seems to be relatively self-contained and portable. the
<code>packettracer</code> AUR package can automate this process, just stick the
<code>.deb</code> in with the <code>PKGBUILD</code> and <code>makepkg -si</code> (it cannot download pt
itself, as cisco does not provide direct download links).
</p>
</div>
</div>

<div id="outline-container-org000000d" class="outline-3">
<h3 id="org000000d"><span class="section-number-3">2.2.</span> fonts</h3>
<div class="outline-text-3" id="text-2-2">
<p>
pt's font handling is absolutely insane.  it lets you choose from only
4 different fonts, all of which are proprietary microsoft ones, and if
those are not present, it does not even have the decency to fallback
to your system's monospace font. that's right, it uses a <i>variable
width</i> font for the console, which <i>literally uses spaces for
alignment</i>.
</p>

<p>
to resolve this, you can install microsoft's fonts with the
<code>ttf-ms-fonts</code> AUR package, or an equivalent for your distribution. it
is probably also possible to trick it into using another font with an
alias in fontconfig, however i was unable to get this to work.
</p>
</div>
</div>

<div id="outline-container-org000000e" class="outline-3">
<h3 id="org000000e"><span class="section-number-3">2.3.</span> port labels</h3>
<div class="outline-text-3" id="text-2-3">
<p>
in <code>Options -&gt; Preferences</code>, turn on <code>Always Show Port Labels in
Logical Workspace</code>. no clue why this is not just on by default.
</p>
</div>
</div>

<div id="outline-container-org000000f" class="outline-3">
<h3 id="org000000f"><span class="section-number-3">2.4.</span> batch editing</h3>
<div class="outline-text-3" id="text-2-4">
<p>
holding control while selecting a device to add or connection type
will make it go into a batch mode, allowing you to add multiple
without having to select it again
</p>
</div>
</div>
</div>
</div>
</body>
</html>
